DataCampRiceDumplingData = DataCampRiceDumplingData or {}

DataCampRiceDumplingData.data_get_length = 4
DataCampRiceDumplingData.data_get = {
	[1] = {id = 1, cost = {{71396,1},{71397,1}}, reward = {{71404,0,1,100},{71405,0,1,100},{71406,0,1,50}}, limit = 0, reward_show = {{71404,1},{71405,1},{71406,1}}, reward_title = "<color='#ffff00'>制作后可随机获得以下汤圆中的一种：</color>"},
	[2] = {id = 2, cost = {{71396,1},{71397,1},{71398,1}}, reward = {{71408,0,1,100}}, limit = 10, reward_show = {{22585,1,0,0,2},{20616,1,0,0,2},{20755,1,0,0,2},{20076,1,0,0,2},{20014,1,0,0,2},{21178,1,1,0,2},{23119,1,1,0,2},{20617,1,1,0,2},{20638,1,1,0,2}}, reward_title = "<color='#ffff00'>使用后可获得以下道具中的一种：</color>"},
	[3] = {id = 3, cost = {{71396,1},{71397,1},{71398,2}}, reward = {{71409,0,1,100}}, limit = 10, reward_show = {{22307,2,0,0,2},{21255,2,0,0,2},{21244,1,0,0,2},{21246,1,0,0,2},{21256,1,0,0,2},{21178,1,1,0,2},{21245,1,1,0,2},{21257,1,1,0,2}}, reward_title = "<color='#ffff00'>使用后可获得以下道具中的一种：</color>"},
	[4] = {id = 4, cost = {{71396,1},{71397,1},{71398,3}}, reward = {{71410,0,1,100}}, limit = 50, reward_show = {{23752,1,0,0,2},{29101,1,0,0,2},{22216,3,0,0,2},{29314,1,0,0,2},{20053,1,0,0,2},{21178,1,1,0,2},{23740,1,1,0,2},{22449,1,1,0,2},{22448,1,1,0,2}}, reward_title = "<color='#ffff00'>使用后可获得以下道具中的一种：</color>"}
}
