DataParade = DataParade or {}

DataParade.data_path_length = 1
DataParade.data_path = {
	["10001_73000"] = {path = {{1818, 2036},{766, 2632},{1414, 2983},{2612, 2342},{2904, 2304},{3519, 2759},{2303, 3404},{1494, 2968},{2605, 2237},{2116, 1893}}}
}

DataParade.data_talk_length = 3
DataParade.data_talk = {
	["10001_73000"] = {max = 20, min = 10, words = {{key = "吃货的一生就是开火车，逛吃逛吃逛吃…"},{key = "吃东西就能涨快乐值，这是天经地义的事！"},{key = "最好吃的东西要最先吃掉，因为你不知道明天和意外哪个先来"},{key = "长得好看的东西往往很美味～"},{key = "你长得这么可爱，肯定很好吃吧？"},{key = "看啊，啤酒泡！"},{key = "嗝～～～"},{key = "别愁眉苦脸的，来一杯！"},{key = "生命在于进食！"},{key = "要爱护小动物，因为他们都很好吃～"}}},
	["10002_73001"] = {max = 20, min = 10, words = {{key = "吃货的一生就是开火车，逛吃逛吃逛吃…"},{key = "吃东西就能涨快乐值，这是天经地义的事！"},{key = "最好吃的东西要最先吃掉，因为你不知道明天和意外哪个先来"},{key = "长得好看的东西往往很美味～"},{key = "你长得这么可爱，肯定很好吃吧？"},{key = "看啊，啤酒泡！"},{key = "嗝～～～"},{key = "别愁眉苦脸的，来一杯！"},{key = "生命在于进食！"},{key = "要爱护小动物，因为他们都很好吃～"}}},
	["10003_73002"] = {max = 20, min = 10, words = {{key = "吃货的一生就是开火车，逛吃逛吃逛吃…"},{key = "吃东西就能涨快乐值，这是天经地义的事！"},{key = "最好吃的东西要最先吃掉，因为你不知道明天和意外哪个先来"},{key = "长得好看的东西往往很美味～"},{key = "你长得这么可爱，肯定很好吃吧？"},{key = "看啊，啤酒泡！"},{key = "嗝～～～"},{key = "别愁眉苦脸的，来一杯！"},{key = "生命在于进食！"},{key = "要爱护小动物，因为他们都很好吃～"}}}
}